docs/MIR.org
#+TITLE: Biscuit-MIR Documentation
#+AUTHOR: Martin Dorazil
#+OPTIONS: toc:nil H:3 num:1 ^:nil pri:t
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup

# now prints out the previously disabled (toc:nil) table of contents.
#+TOC: headlines 2

* About
 BL-MIR (Biscuit Language Middle Intermediate Representation) is a simplified representation of the Biscuit Language created from AST. It is located between AST and LLVM-IR. 

** MIR Interpreter
   BL Compiler has integrated interpreter for MIR. 
   
   - Default execution stack size is 2MB.
   - Stack allocations are 8 byte aligned.

** Assert function example
   #+BEGIN_SRC bl
   assert :: fn (cond: bool) {
     if (!cond) {
       unreachable;
     }
   };
   #+END_SRC

   #+BEGIN_SRC blm
   @assert fn(bool) void {
   %entry_0:
     %0              bool arg $0
     %1              void decl cond : bool = %0
     %2             *bool declref cond
     %5              bool load %2
     %3              bool unop !%5
     %4              void br %3 ? %if_then_1 : %if_else_2
   
   %if_then_1:
     %5              void unreachable 
     %6              void br %if_cont_3
   
   %if_else_2:
     %7              void br %if_cont_3
   
   %if_cont_3:
     %8              void ret 
   }
   #+END_SRC
   
   #+BEGIN_SRC llvm
   define void @assert(i1) {
   entry:
     %cond = alloca i1, align 1
     store i1 %0, i1* %cond
     %1 = load i1, i1* %cond, align 1
     %2 = xor i1 %1, true
     br i1 %2, label %if_then, label %if_else
   
   if_then:                                          ; preds = %entry
     call void @llvm.debugtrap()
     br label %if_cont
   
   if_else:                                          ; preds = %entry
     br label %if_cont
   
   if_cont:                                          ; preds = %if_else, %if_then
     ret void
   }
   #+END_SRC

   
** Stack manipulation
   - Interpreter is used for evaluation of compile-time known expressions during analyze process.
   - Compile-time known values are not pushed on the stack.

   Example function:
   #+BEGIN_SRC bl
   assert :: fn (cond: bool) {
     if (!cond) {
       unreachable;
     }
   };

   main :: fn () s32 {
     v :: 10;
     assert(v == 10);
     return 0;
   };
   #+END_SRC

   Stack operation produced during execution of the main function:
   #+BEGIN_EXAMPLE
   executing 'main' in compile time...
        -             Terminal  PUSH RA
       15            InstrCall  PUSH RA
       27             InstrArg  PUSH    (1B, 0x7fbd02347078) bool
       28         InstrDeclVar  POP     (1B, 0x7fbd0234707f) bool
       28         InstrDeclVar  PUSH    (1B, 0x7fbd02347078) bool
       39            InstrLoad  PUSH    (1B, 0x7fbd02347080) bool
       33            InstrUnop  POP     (1B, 0x7fbd02347087) bool
       33            InstrUnop  PUSH    (1B, 0x7fbd02347080) bool
       34          InstrCondBr  POP     (1B, 0x7fbd02347087) bool
       40             InstrRet  POP RA
       17             InstrRet  POP RA
   execution finished with state: 0
   #+END_EXAMPLE


* Function
   #+BEGIN_EXAMPLE
   @<name> <T> [flags] { 
     [entry block]
   }
   #+END_EXAMPLE

* Block
  Basic block representation.

  #+BEGIN_EXAMPLE
  <name>: 
    ...
    <terminal instruction>
  #+END_EXAMPLE

* Instructions 
  
** const
   Constant values are known in compile time.

   #+BEGIN_EXAMPLE
   <T> const <value> // yields constant value of the type T
   #+END_EXAMPLE

** decl
   Variable declaration.

   #+BEGIN_EXAMPLE
   void decl <name> : <T> = <init value> // yields void 
   #+END_EXAMPLE

   | stack op | data | description              |
   |----------+------+--------------------------|
   | PUSH     | -    | storage for the variable |

   Constant declaration.

   #+BEGIN_EXAMPLE
   void decl <name> : <T> : <init value> // yields void 
   #+END_EXAMPLE
