docs/MIR.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-06 Wed 22:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Biscuit-MIR Documentation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Martin Dorazil" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Biscuit-MIR Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3f4aa12">1. About</a>
<ul>
<li><a href="#orgdb7a6a9">MIR Interpreter</a></li>
<li><a href="#org9eb55da">Assert function example</a></li>
<li><a href="#org870dc94">Stack manipulation</a></li>
</ul>
</li>
<li><a href="#orge010641">2. Function</a></li>
<li><a href="#orgecc35d0">3. Block</a></li>
<li><a href="#org70dc176">4. Instructions</a>
<ul>
<li><a href="#org986637a">const</a></li>
<li><a href="#orge540cc1">decl</a></li>
<li><a href="#orgab66df7">declref</a></li>
<li><a href="#org94cd733">load</a></li>
<li><a href="#orgdd215aa">store</a></li>
<li><a href="#org2ed446f">arg</a></li>
<li><a href="#orgf30e446">call</a></li>
<li><a href="#orgd4f8165">ret</a></li>
<li><a href="#org713e703">br</a></li>
<li><a href="#orgda187d1">br (conditional)</a></li>
<li><a href="#orgdcbbc7d">unreachable</a></li>
<li><a href="#org20b2042">binop</a></li>
<li><a href="#org7a490d5">unop</a></li>
<li><a href="#org4117e21">elemptr</a></li>
<li><a href="#org9f799dd">memberptr</a></li>
<li><a href="#orgc591106">addrof</a></li>
<li><a href="#org0b3e42e">bitcast</a></li>
<li><a href="#orgb94d20e">sext</a></li>
<li><a href="#org5abc4ed">zext</a></li>
<li><a href="#orge049fa7">trunc</a></li>
<li><a href="#orgf80cc39">fptosi</a></li>
<li><a href="#org3ded1f3">fptoui</a></li>
<li><a href="#orgf0f7f80">ptrtoint</a></li>
<li><a href="#orgf4687f7">inttoptr</a></li>
</ul>
</li>
<li><a href="#orgd632e0c">5. Special instructions</a>
<ul>
<li><a href="#org9bfc72f">validate_type</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3f4aa12" class="outline-2">
<h2 id="org3f4aa12"><span class="section-number-2">1</span> About</h2>
<div class="outline-text-2" id="text-1">
<p>
BL-MIR (Biscuit Language Middle Intermediate Representation) is a simplified representation of the Biscuit Language created from AST. It is located between AST and LLVM-IR. 
</p>
</div>

<div id="outline-container-orgdb7a6a9" class="outline-3">
<h3 id="orgdb7a6a9">MIR Interpreter</h3>
<div class="outline-text-3" id="text-orgdb7a6a9">
<p>
BL Compiler has integrated interpreter for MIR. 
</p>

<ul class="org-ul">
<li>Default execution stack size is 2MB.</li>
<li>Stack allocations are 8 byte aligned.</li>
</ul>
</div>
</div>

<div id="outline-container-org9eb55da" class="outline-3">
<h3 id="org9eb55da">Assert function example</h3>
<div class="outline-text-3" id="text-org9eb55da">
<div class="org-src-container">
<pre class="src src-bl"><span class="org-function-name">assert</span> :: <span class="org-keyword">fn</span> (cond: <span class="org-type">bool</span>) {
  <span class="org-keyword">if</span> (!cond) {
    <span class="org-keyword">unreachable</span>;
  }
};
</pre>
</div>

<div class="org-src-container">
<pre class="src src-blm"><span class="org-function-name">@assert</span> fn(<span class="org-type">bool</span>) <span class="org-type">void</span> {
<span class="org-variable-name">%entry_0</span>:
  <span class="org-variable-name">%0</span>              <span class="org-type">bool</span> <span class="org-keyword">arg</span> <span class="org-constant">$0</span>
  <span class="org-variable-name">%1</span>              <span class="org-type">void</span> <span class="org-keyword">decl</span> cond : <span class="org-type">bool</span> = <span class="org-variable-name">%0</span>
  <span class="org-variable-name">%2</span>             *<span class="org-type">bool</span> <span class="org-keyword">declref</span> cond
  <span class="org-variable-name">%5</span>              <span class="org-type">bool</span> <span class="org-keyword">load</span> <span class="org-variable-name">%2</span>
  <span class="org-variable-name">%3</span>              <span class="org-type">bool</span> <span class="org-keyword">unop</span> !<span class="org-variable-name">%5</span>
  <span class="org-variable-name">%4</span>              <span class="org-type">void</span> <span class="org-keyword">br</span> <span class="org-variable-name">%3</span> ? <span class="org-variable-name">%if_then_1</span> : <span class="org-variable-name">%if_else_2</span>

<span class="org-variable-name">%if_then_1</span>:
  <span class="org-variable-name">%5</span>              <span class="org-type">void</span> <span class="org-keyword">unreachable</span> 
  <span class="org-variable-name">%6</span>              <span class="org-type">void</span> <span class="org-keyword">br</span> <span class="org-variable-name">%if_cont_3</span>

<span class="org-variable-name">%if_else_2</span>:
  <span class="org-variable-name">%7</span>              <span class="org-type">void</span> <span class="org-keyword">br</span> <span class="org-variable-name">%if_cont_3</span>

<span class="org-variable-name">%if_cont_3</span>:
  <span class="org-variable-name">%8</span>              <span class="org-type">void</span> <span class="org-keyword">ret</span> 
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-llvm"><span class="org-keyword">define</span> <span class="org-type">void</span> @assert(<span class="org-type">i1</span>) {
<span class="org-variable-name">entry:</span>
  <span class="org-variable-name">%cond</span> = <span class="org-keyword">alloca</span> <span class="org-type">i1</span>, align <span class="org-preprocessor">1</span>
  <span class="org-keyword">store</span> <span class="org-type">i1</span> <span class="org-variable-name">%0</span>, i1* <span class="org-variable-name">%cond</span>
  <span class="org-variable-name">%1</span> = <span class="org-keyword">load</span> <span class="org-type">i1</span>, i1* <span class="org-variable-name">%cond</span>, align <span class="org-preprocessor">1</span>
  <span class="org-variable-name">%2</span> = <span class="org-keyword">xor</span> <span class="org-type">i1</span> <span class="org-variable-name">%1</span>, <span class="org-keyword">true</span>
  <span class="org-keyword">br</span> <span class="org-type">i1</span> <span class="org-variable-name">%2</span>, <span class="org-type">label</span> <span class="org-variable-name">%if_then</span>, <span class="org-type">label</span> <span class="org-variable-name">%if_else</span>

<span class="org-variable-name">if_then:</span>                                          <span class="org-comment">; preds = %entry</span>
  <span class="org-keyword">call</span> <span class="org-type">void</span> @llvm.debugtrap()
  <span class="org-keyword">br</span> <span class="org-type">label</span> <span class="org-variable-name">%if_cont</span>

<span class="org-variable-name">if_else:</span>                                          <span class="org-comment">; preds = %entry</span>
  <span class="org-keyword">br</span> <span class="org-type">label</span> <span class="org-variable-name">%if_cont</span>

<span class="org-variable-name">if_cont:</span>                                          <span class="org-comment">; preds = %if_else, %if_then</span>
  <span class="org-keyword">ret</span> <span class="org-type">void</span>
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org870dc94" class="outline-3">
<h3 id="org870dc94">Stack manipulation</h3>
<div class="outline-text-3" id="text-org870dc94">
<ul class="org-ul">
<li>Interpreter is used for evaluation of compile-time known expressions during analyze process.</li>
<li>Compile-time known values are not pushed on the stack.</li>
</ul>

<p>
Example function:
</p>
<div class="org-src-container">
<pre class="src src-bl"><span class="org-function-name">assert</span> :: <span class="org-keyword">fn</span> (cond: <span class="org-type">bool</span>) {
  <span class="org-keyword">if</span> (!cond) {
    <span class="org-keyword">unreachable</span>;
  }
};

<span class="org-function-name">main</span> :: <span class="org-keyword">fn</span> () <span class="org-type">s32</span> {
  <span class="org-constant">v</span> :: <span class="org-constant">10</span>;
  <span class="org-function-name">assert</span>(v == <span class="org-constant">10</span>);
  <span class="org-keyword">return</span> <span class="org-constant">0</span>;
};
</pre>
</div>

<p>
Stack operation produced during execution of the main function:
</p>
<pre class="example">
executing 'main' in compile time...
     -             Terminal  PUSH RA
    15            InstrCall  PUSH RA
    27             InstrArg  PUSH    (1B, 0x7fbd02347078) bool
    28         InstrDeclVar  POP     (1B, 0x7fbd0234707f) bool
    28         InstrDeclVar  PUSH    (1B, 0x7fbd02347078) bool
    39            InstrLoad  PUSH    (1B, 0x7fbd02347080) bool
    33            InstrUnop  POP     (1B, 0x7fbd02347087) bool
    33            InstrUnop  PUSH    (1B, 0x7fbd02347080) bool
    34          InstrCondBr  POP     (1B, 0x7fbd02347087) bool
    40             InstrRet  POP RA
    17             InstrRet  POP RA
execution finished with state: 0
</pre>
</div>
</div>
</div>


<div id="outline-container-orge010641" class="outline-2">
<h2 id="orge010641"><span class="section-number-2">2</span> Function</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
@&lt;name&gt; &lt;T&gt; [flags] { 
  [entry block]
}
</pre>
</div>
</div>

<div id="outline-container-orgecc35d0" class="outline-2">
<h2 id="orgecc35d0"><span class="section-number-2">3</span> Block</h2>
<div class="outline-text-2" id="text-3">
<p>
Basic block representation.
</p>

<pre class="example">
&lt;name&gt;: 
  ...
  &lt;terminal instruction&gt;
</pre>
</div>
</div>

<div id="outline-container-org70dc176" class="outline-2">
<h2 id="org70dc176"><span class="section-number-2">4</span> Instructions</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org986637a" class="outline-3">
<h3 id="org986637a">const</h3>
<div class="outline-text-3" id="text-org986637a">
<p>
Constant values are known in compile time.
</p>

<pre class="example">
&lt;T&gt; const &lt;value&gt; // yields constant value of the type T
</pre>
</div>
</div>

<div id="outline-container-orge540cc1" class="outline-3">
<h3 id="orge540cc1">decl</h3>
<div class="outline-text-3" id="text-orge540cc1">
<p>
Variable declaration.
</p>

<pre class="example">
void decl &lt;name&gt; : &lt;T&gt; = &lt;init value&gt; // yields void 
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PUSH</td>
<td class="org-left">-</td>
<td class="org-left">storage for the variable</td>
</tr>
</tbody>
</table>

<p>
Constant declaration.
</p>

<pre class="example">
void decl &lt;name&gt; : &lt;T&gt; : &lt;init value&gt; // yields void 
</pre>
</div>
</div>
