docs/MIR.org
** declref
   Reference to some declaration. This instruction is 'noop'. Symbol lookup is done here during analyze pass, when symbol is not found error is generated.
   
   #+BEGIN_EXAMPLE
   <T*> declref <name> // yields pointer to found declaration
   #+END_EXAMPLE

** load
   Push pointed value on the stack.

   #+BEGIN_EXAMPLE
   <T> load <ptr> // yields T loaded from ptr
   #+END_EXAMPLE

   | stack op | data  | description              |
   |----------+-------+--------------------------|
   | POP      | ptr   | pointer to source        |
   | PUSH     | value | value loaded from source |
   
** store
   Store value from source to destination address.

   #+BEGIN_EXAMPLE
   void store <src> -> <dest ptr> // yields void
   #+END_EXAMPLE

   | stack op | data     | description            |
   |----------+----------+------------------------|
   | POP      | dest ptr | pointer to destination |
   | POP      | src ptr  | value                  |
   
** arg
   Load argument of the current function on the stack.

   #+BEGIN_EXAMPLE
   <T> arg $<arg number> // yields T
   #+END_EXAMPLE

   | stack op | data | description |
   |----------+------+-------------|
   | PUSH     | arg  | fn argument |

** call
   Call function. This instruction will create new stack frame and switch control to the callee. All call arguments in example case are known only in runtime (compile-time known arguments is passed by const value).

   | stack op | data         | description                                                                |
   |----------+--------------+----------------------------------------------------------------------------|
   | PUSH     | arg 3        | push 3rd argument                                                          |
   | PUSH     | arg 2        | push 2nd argument                                                          |
   | PUSH     | arg 1        | push 1st argument                                                          |
   | PUSH RA  | pc, call ptr | create new frame stack (push program counter and call instruction pointer) |

** ret
   Return value from the function and return control to the caller. This instruction terminates current basic block.

   #+BEGIN_EXAMPLE
   void ret [value] // yields void
   #+END_EXAMPLE

   | stack op | data  | description                            |
   |----------+-------+----------------------------------------|
   | POP RA   | -     | rollback the stack to return address   |
   | POP      | arg 1 | clenup fn argument                     |
   | POP      | arg 2 | clenup fn argument                     |
   | POP      | arg 3 | clenup fn argument                     |
   | PUSH     | value | push call result value if there is one |

** br
   Breaks to the basic block. This instruction terminates current basic block.

   #+BEGIN_EXAMPLE
   void br <block> // yields void
   #+END_EXAMPLE

** br (conditional)
   Breaks into then block if the condition is true. This instruction terminates current basic block.

   #+BEGIN_EXAMPLE
   void br <cont> ? <then_block> : <else_block> // yields void
   #+END_EXAMPLE

   | stack op | data      | description       |
   |----------+-----------+-------------------|
   | POP      | condition | checked condition |

** unreachable
   Abort execution when this instruction is reached.

** binop
   Binary operation.

   #+BEGIN_EXAMPLE
   <T> binop <lhs> <+|-|*|/|%> <rhs> // yields result value of type T
   #+END_EXAMPLE

   | stack op | data   | description                   |
   |----------+--------+-------------------------------|
   | POP      | lhs    | left-hand side of operation   |
   | POP      | rhs    | right-hand side of operation  |
   | PUSH     | result | result value of the operation |

** unop
   Unary operation.

   #+BEGIN_EXAMPLE
   <T> unop <+|-|*|&> <value> // yields result value of type T
   #+END_EXAMPLE

   | stack op | data   | description                   |
   |----------+--------+-------------------------------|
   | POP      | value  |                               |
   | PUSH     | result | result value of the operation |

** elemptr
   Evaluates address of the array element and push it on the stack.

   #+BEGIN_EXAMPLE
   <*T> elemptr <arr ptr>[<index>] // yields result address *T (elem type)
   #+END_EXAMPLE

   | stack op | data     | description                  |
   |----------+----------+------------------------------|
   | POP      | index    |                              |
   | PUSH     | elem ptr | Address of the array element |
** memberptr
   Evaluates address of member access via '.' operator.

   #+BEGIN_EXAMPLE
   <*T> memberptr <target ptr>.<member name|order> // yields result address *T (member type)
   #+END_EXAMPLE

   | stack op | data       | description           |
   |----------+------------+-----------------------|
   | POP      | target ptr |                       |
   | PUSH     | member ptr | Address of the member |
