docs/MIR.html
<div id="outline-container-orgab66df7" class="outline-3">
<h3 id="orgab66df7">declref</h3>
<div class="outline-text-3" id="text-orgab66df7">
<p>
Reference to some declaration. This instruction is 'noop'. Symbol lookup is done here during analyze pass, when symbol is not found error is generated.
</p>

<pre class="example">
&lt;T*&gt; declref &lt;name&gt; // yields pointer to found declaration
</pre>
</div>
</div>

<div id="outline-container-org94cd733" class="outline-3">
<h3 id="org94cd733">load</h3>
<div class="outline-text-3" id="text-org94cd733">
<p>
Push pointed value on the stack.
</p>

<pre class="example">
&lt;T&gt; load &lt;ptr&gt; // yields T loaded from ptr
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POP</td>
<td class="org-left">ptr</td>
<td class="org-left">pointer to source</td>
</tr>

<tr>
<td class="org-left">PUSH</td>
<td class="org-left">value</td>
<td class="org-left">value loaded from source</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgdd215aa" class="outline-3">
<h3 id="orgdd215aa">store</h3>
<div class="outline-text-3" id="text-orgdd215aa">
<p>
Store value from source to destination address.
</p>

<pre class="example">
void store &lt;src&gt; -&gt; &lt;dest ptr&gt; // yields void
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POP</td>
<td class="org-left">dest ptr</td>
<td class="org-left">pointer to destination</td>
</tr>

<tr>
<td class="org-left">POP</td>
<td class="org-left">src ptr</td>
<td class="org-left">value</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2ed446f" class="outline-3">
<h3 id="org2ed446f">arg</h3>
<div class="outline-text-3" id="text-org2ed446f">
<p>
Load argument of the current function on the stack.
</p>

<pre class="example">
&lt;T&gt; arg $&lt;arg number&gt; // yields T
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PUSH</td>
<td class="org-left">arg</td>
<td class="org-left">fn argument</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf30e446" class="outline-3">
<h3 id="orgf30e446">call</h3>
<div class="outline-text-3" id="text-orgf30e446">
<p>
Call function. This instruction will create new stack frame and switch control to the callee. All call arguments in example case are known only in runtime (compile-time known arguments is passed by const value).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PUSH</td>
<td class="org-left">arg 3</td>
<td class="org-left">push 3rd argument</td>
</tr>

<tr>
<td class="org-left">PUSH</td>
<td class="org-left">arg 2</td>
<td class="org-left">push 2nd argument</td>
</tr>

<tr>
<td class="org-left">PUSH</td>
<td class="org-left">arg 1</td>
<td class="org-left">push 1st argument</td>
</tr>

<tr>
<td class="org-left">PUSH RA</td>
<td class="org-left">pc, call ptr</td>
<td class="org-left">create new frame stack (push program counter and call instruction pointer)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd4f8165" class="outline-3">
<h3 id="orgd4f8165">ret</h3>
<div class="outline-text-3" id="text-orgd4f8165">
<p>
Return value from the function and return control to the caller. This instruction terminates current basic block.
</p>

<pre class="example">
void ret [value] // yields void
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POP RA</td>
<td class="org-left">-</td>
<td class="org-left">rollback the stack to return address</td>
</tr>

<tr>
<td class="org-left">POP</td>
<td class="org-left">arg 1</td>
<td class="org-left">clenup fn argument</td>
</tr>

<tr>
<td class="org-left">POP</td>
<td class="org-left">arg 2</td>
<td class="org-left">clenup fn argument</td>
</tr>

<tr>
<td class="org-left">POP</td>
<td class="org-left">arg 3</td>
<td class="org-left">clenup fn argument</td>
</tr>

<tr>
<td class="org-left">PUSH</td>
<td class="org-left">value</td>
<td class="org-left">push call result value if there is one</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org713e703" class="outline-3">
<h3 id="org713e703">br</h3>
<div class="outline-text-3" id="text-org713e703">
<p>
Breaks to the basic block. This instruction terminates current basic block.
</p>

<pre class="example">
void br &lt;block&gt; // yields void
</pre>
</div>
</div>

<div id="outline-container-orgda187d1" class="outline-3">
<h3 id="orgda187d1">br (conditional)</h3>
<div class="outline-text-3" id="text-orgda187d1">
<p>
Breaks into then block if the condition is true. This instruction terminates current basic block.
</p>

<pre class="example">
void br &lt;cont&gt; ? &lt;then_block&gt; : &lt;else_block&gt; // yields void
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POP</td>
<td class="org-left">condition</td>
<td class="org-left">checked condition</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgdcbbc7d" class="outline-3">
<h3 id="orgdcbbc7d">unreachable</h3>
<div class="outline-text-3" id="text-orgdcbbc7d">
<p>
Abort execution when this instruction is reached.
</p>
</div>
</div>

<div id="outline-container-org20b2042" class="outline-3">
<h3 id="org20b2042">binop</h3>
<div class="outline-text-3" id="text-org20b2042">
<p>
Binary operation.
</p>

<pre class="example">
&lt;T&gt; binop &lt;lhs&gt; &lt;+|-|*|/|%&gt; &lt;rhs&gt; // yields result value of type T
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POP</td>
<td class="org-left">lhs</td>
<td class="org-left">left-hand side of operation</td>
</tr>

<tr>
<td class="org-left">POP</td>
<td class="org-left">rhs</td>
<td class="org-left">right-hand side of operation</td>
</tr>

<tr>
<td class="org-left">PUSH</td>
<td class="org-left">result</td>
<td class="org-left">result value of the operation</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7a490d5" class="outline-3">
<h3 id="org7a490d5">unop</h3>
<div class="outline-text-3" id="text-org7a490d5">
<p>
Unary operation.
</p>

<pre class="example">
&lt;T&gt; unop &lt;+|-|*|&amp;&gt; &lt;value&gt; // yields result value of type T
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POP</td>
<td class="org-left">value</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PUSH</td>
<td class="org-left">result</td>
<td class="org-left">result value of the operation</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4117e21" class="outline-3">
<h3 id="org4117e21">elemptr</h3>
<div class="outline-text-3" id="text-org4117e21">
<p>
Evaluates address of the array element and push it on the stack.
</p>

<pre class="example">
&lt;*T&gt; elemptr &lt;arr ptr&gt;[&lt;index&gt;] // yields result address *T (elem type)
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POP</td>
<td class="org-left">index</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PUSH</td>
<td class="org-left">elem ptr</td>
<td class="org-left">Address of the array element</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9f799dd" class="outline-3">
<h3 id="org9f799dd">memberptr</h3>
<div class="outline-text-3" id="text-org9f799dd">
<p>
Evaluates address of member access via '.' operator.
</p>

<pre class="example">
&lt;*T&gt; memberptr &lt;target ptr&gt;.&lt;member name|order&gt; // yields result address *T (member type)
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POP</td>
<td class="org-left">target ptr</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PUSH</td>
<td class="org-left">member ptr</td>
<td class="org-left">Address of the member</td>
</tr>
</tbody>
</table>
</div>
</div>
