docs/MIR.html
<div id="outline-container-orgc591106" class="outline-3">
<h3 id="orgc591106">addrof</h3>
<div class="outline-text-3" id="text-orgc591106">
<p>
Evaluates address of the variable.
</p>

<pre class="example">
&lt;*T&gt; addrof &lt;target&gt; // yields result address *T
</pre>

<p>
Getting address of variable:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PUSH</td>
<td class="org-left">var ptr</td>
<td class="org-left">pointer to allocated variable</td>
</tr>
</tbody>
</table>

<p>
Skipped when address has been pushed by previous instruction (ex.: 'elemptr').
</p>
</div>
</div>

<div id="outline-container-org0b3e42e" class="outline-3">
<h3 id="org0b3e42e">bitcast</h3>
<div class="outline-text-3" id="text-org0b3e42e">
<p>
Produce bit casting from one type to other. Bit cast just change type of pushed value. No stack operations are produced.
</p>

<pre class="example">
&lt;T&gt; bitcast &lt;target&gt; // yields value with casted type
</pre>
</div>
</div>

<div id="outline-container-orgb94d20e" class="outline-3">
<h3 id="orgb94d20e">sext</h3>
<div class="outline-text-3" id="text-orgb94d20e">
<p>
Signed-extend cast. 
</p>

<pre class="example">
&lt;T&gt; sext &lt;target&gt; // yields value with casted type
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POP</td>
<td class="org-left">target</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PUSH</td>
<td class="org-left">result</td>
<td class="org-left">result with new type</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org5abc4ed" class="outline-3">
<h3 id="org5abc4ed">zext</h3>
<div class="outline-text-3" id="text-org5abc4ed">
<p>
Zero-extend cast. 
</p>

<pre class="example">
&lt;T&gt; zext &lt;target&gt; // yields value with casted type
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POP</td>
<td class="org-left">target</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PUSH</td>
<td class="org-left">resutlt</td>
<td class="org-left">result with new type</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge049fa7" class="outline-3">
<h3 id="orge049fa7">trunc</h3>
<div class="outline-text-3" id="text-orge049fa7">
<p>
Truncates target to destination type 'T'.
</p>

<pre class="example">
&lt;T&gt; trunc &lt;target&gt; // yields value with casted type
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">stack op</th>
<th scope="col" class="org-left">data</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POP</td>
<td class="org-left">target</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PUSH</td>
<td class="org-left">resutlt</td>
<td class="org-left">result with new type</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf80cc39" class="outline-3">
<h3 id="orgf80cc39">fptosi</h3>
<div class="outline-text-3" id="text-orgf80cc39">
<p>
Floating point to signed integer cast. 
</p>

<pre class="example">
&lt;T&gt; fptosi &lt;target&gt; // yields value with casted type
</pre>
</div>
</div>
<div id="outline-container-org3ded1f3" class="outline-3">
<h3 id="org3ded1f3">fptoui</h3>
<div class="outline-text-3" id="text-org3ded1f3">
<p>
Floating point to unsigned integer cast. 
</p>

<pre class="example">
&lt;T&gt; fptoui &lt;target&gt; // yields value with casted type
</pre>
</div>
</div>
<div id="outline-container-orgf0f7f80" class="outline-3">
<h3 id="orgf0f7f80">ptrtoint</h3>
<div class="outline-text-3" id="text-orgf0f7f80">
<p>
Pointer to integer cast. This cast is noop cast when T has same size as type of the target.
</p>

<pre class="example">
&lt;T&gt; ptrtoint &lt;target&gt; // yields value with casted type
</pre>
</div>
</div>
<div id="outline-container-orgf4687f7" class="outline-3">
<h3 id="orgf4687f7">inttoptr</h3>
<div class="outline-text-3" id="text-orgf4687f7">
<p>
Integer to pointer cast. This cast is noop cast when T has same size as type of the target.
</p>

<pre class="example">
&lt;T&gt; inttoptr &lt;target&gt; // yields value with casted type
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd632e0c" class="outline-2">
<h2 id="orgd632e0c"><span class="section-number-2">5</span> Special instructions</h2>
<div class="outline-text-2" id="text-5">
<p>
Special instructions are used only during analyze pass inside the compiler.
</p>
</div>

<div id="outline-container-org9bfc72f" class="outline-3">
<h3 id="org9bfc72f">validate_type</h3>
<div class="outline-text-3" id="text-org9bfc72f">
<p>
Validates if the source instruction yields value of type 'type'. 
</p>

<pre class="example">
void validate_type &lt;src&gt; // yields void
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Martin Dorazil</p>
<p class="date">Created: 2019-02-06 Wed 22:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
